In [30]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

-- Seleção de dados Unicos - aponta qual a lista retorno de um lista que contem valores unicos;

In [3]:
df['col2'].unique()

array([444, 555, 666])

In [4]:
import numpy as np

In [5]:
np.unique(df['col2'])

array([444, 555, 666])

In [6]:
len(df['col2'].unique())

3

In [7]:
df['col2'].nunique()

3

In [8]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [9]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [10]:
df[(df['col1']>2)&(df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [16]:
def vezes2(x):
    return x*2

In [17]:
df.sum()

col1              10
col2            2109
col3    abcdefghixyz
dtype: object

In [18]:
df['col1'].sum()

10

In [19]:
df['col1'].apply(vezes2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [21]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [22]:
df['col1'].apply(lambda x :x*x)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [23]:
del df['col2']

In [24]:
df

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

In [25]:
df.columns

Index(['col1', 'col3'], dtype='object')

In [27]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [33]:
df.sort_values(by = 'col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [34]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [35]:
df.dropna()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [36]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],'col2':[np.nan,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [41]:
df['col1'].fillna(value = df['col1'].mean(), inplace = True)

In [42]:
df

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   2.0  444.0  xyz